{
    "category": {
        "id": "relational-databases",
        "name": "Relational databases"
    },
    "id": "postgresql",
    "website": "https://www.postgresql.org/",
    "title": "PostgreSQL",
    "description": "PostgreSQL is a powerful, open-source object-relational database system, known for reliability, data integrity and performance.",
    "long_description": "PostgreSQL is a powerful, open-source, object-relational database system that uses and extends the SQL language combined with many features that safely store and scale the most complicated data workloads. It has a strong reputation for its architecture, reliability, data integrity, robust feature set and extensibility. It runs on all major operating systems, is ACID-compliant, and has powerful add-ons such as the PostGIS geospatial database extender.",
    "logo": "/images/databases/relational-databases/postgresql/logo.png",
    "screenshots": [
        "/images/databases/relational-databases/postgresql/screenshot-1.jpg",
        "/images/databases/relational-databases/postgresql/screenshot-2.jpg"
    ],
    "dashboardImage": "/images/databases/relational-databases/postgresql/screenshot-1.jpg",
    "features": [
        {
            "title": "Wide range of data types",
            "description": "PostgreSQL is one of the most advanced open-source databases, with numerous data types and functions added over the years. Data types include: Primitives: Integer, Numeric, String, Boolean. Structured: Date/Time, Array, Range / Multirange, UUID. Document: JSON/JSONB, XML, Key-value (Hstore). Geometry: Point, Line, Circle, Polygon. Customizations: Composite, Custom Types."
        },
        {
            "title": "Data integrity",
            "description": "PostgreSQL strives to conform to the ANSI-SQL:2008 standard, is fully ACID (Atomicity, Consistency, Isolation and Durability) compliant, and is well-known for its rock-solid referential and transactional integrity. Its data integrity features ensure only validated data is stored."
        },
        {
            "title": "High security",
            "description": "All files stored in the database are protected from reading by any account other than the superuser account. Authentication is ensured via: GSSAPI, SSPI, LDAP, SCRAM-SHA-256, Certificate, and more; a robust access-control system; column and row-level security; and multi-factor authentication with certificates."
        },
        {
            "title": "Extensibility",
            "description": "PostgreSQL is extensible because its operation is catalog-driven, with stored functions and procedures; Procedural Languages (PL/PGSQL, Perl, Python, etc);  SQL/JSON path expressions; foreign data wrappers; customizable storage interface for tables, and many extensions that provide additional functionality, including PostGIS."
        }
    ]
}